# Setup

In [61]:
import pandas as pd
# Create messy dataset

data = {
    "Name":["Alice", "Bob", "Charlie", "Alice", "Eve", None],
    "Age": [25, None, 90, 25, 25, 22],
    "Salary" :[50000, 60000, None, 50000, 58000, 62000],
    "JoinDate":["2021-01-01","2021-02-14","not available", "2021-01-01", "2021-03-20","2021-04-15"],
    "Department": ["HR","Finance", "IT", "HR", "Finance","finance"]

}

df = pd.DataFrame(data)
df

      Name   Age   Salary       JoinDate Department
0    Alice  25.0  50000.0     2021-01-01         HR
1      Bob   NaN  60000.0     2021-02-14    Finance
2  Charlie  90.0      NaN  not available         IT
3    Alice  25.0  50000.0     2021-01-01         HR
4      Eve  25.0  58000.0     2021-03-20    Finance
5     None  22.0  62000.0     2021-04-15    finance

# Handling Missing Values

In [62]:
#Check for missing values
df.isnull().sum()

Name          1
Age           1
Salary        1
JoinDate      0
Department    0
dtype: int64

In [63]:
#Drop missing values
df_dropna = df.dropna()
df_dropna

    Name   Age   Salary    JoinDate Department
0  Alice  25.0  50000.0  2021-01-01         HR
3  Alice  25.0  50000.0  2021-01-01         HR
4    Eve  25.0  58000.0  2021-03-20    Finance

In [64]:
# Make a copy of the original DataFrame so we don't ovewrite it
df_fill = df.copy()
df_fill

      Name   Age   Salary       JoinDate Department
0    Alice  25.0  50000.0     2021-01-01         HR
1      Bob   NaN  60000.0     2021-02-14    Finance
2  Charlie  90.0      NaN  not available         IT
3    Alice  25.0  50000.0     2021-01-01         HR
4      Eve  25.0  58000.0     2021-03-20    Finance
5     None  22.0  62000.0     2021-04-15    finance

In [65]:
#Fill missing values in the Age column with the mean age
df_fill["Age"] = df_fill["Age"].fillna(df_fill["Age"].mean())
df_fill

      Name   Age   Salary       JoinDate Department
0    Alice  25.0  50000.0     2021-01-01         HR
1      Bob  37.4  60000.0     2021-02-14    Finance
2  Charlie  90.0      NaN  not available         IT
3    Alice  25.0  50000.0     2021-01-01         HR
4      Eve  25.0  58000.0     2021-03-20    Finance
5     None  22.0  62000.0     2021-04-15    finance

In [66]:
#Fill missing values in the "Salary" column with the median salary
df_fill["Salary"] = df_fill["Salary"].fillna(df_fill["Salary"].median())
df_fill

      Name   Age   Salary       JoinDate Department
0    Alice  25.0  50000.0     2021-01-01         HR
1      Bob  37.4  60000.0     2021-02-14    Finance
2  Charlie  90.0  58000.0  not available         IT
3    Alice  25.0  50000.0     2021-01-01         HR
4      Eve  25.0  58000.0     2021-03-20    Finance
5     None  22.0  62000.0     2021-04-15    finance

In [67]:
#Fill missing values in the "Name" column with the word Chepng'etich
df_fill["Name"] = df_fill["Name"].fillna('Chepng\'etich')
df_fill

           Name   Age   Salary       JoinDate Department
0         Alice  25.0  50000.0     2021-01-01         HR
1           Bob  37.4  60000.0     2021-02-14    Finance
2       Charlie  90.0  58000.0  not available         IT
3         Alice  25.0  50000.0     2021-01-01         HR
4           Eve  25.0  58000.0     2021-03-20    Finance
5  Chepng'etich  22.0  62000.0     2021-04-15    finance

In [68]:
#Display the cleaned DataFrame
df_fill

           Name   Age   Salary       JoinDate Department
0         Alice  25.0  50000.0     2021-01-01         HR
1           Bob  37.4  60000.0     2021-02-14    Finance
2       Charlie  90.0  58000.0  not available         IT
3         Alice  25.0  50000.0     2021-01-01         HR
4           Eve  25.0  58000.0     2021-03-20    Finance
5  Chepng'etich  22.0  62000.0     2021-04-15    finance

# Outlier Detection

In [69]:
import numpy as np
#A quartile is a statistical value that divides a data into four equal parts, where each part contains 25% of the data points.
#Calculate the first quartile(25th percentile) of the "Age" column 
Q1 = df_fill["Age"].quantile(0.25)

#Calculate the third quartile(75th Percentile) of the "Age" column
Q3 = df_fill["Age"].quantile(0.75)

#Compute the Interquartile Range (IRQ = Q3 - Q1)
IQR = Q3 - Q1
Q1 - 1.5*IQR

#Identify outliers
#An outlier is any value less than (Q1 - 1.5*IQR) or greater than (Q3 + 1.5*IQR)
#outliers = df_fill[(df_fill["Age"] < Q1 - 1.5*IQR) | (df["Age"] > Q3 + 1.5*IQR)]

#Display the rows that contain outliers.
#outliers

IQR

np.float64(9.299999999999997)

# Data Type Conversion

In [70]:
#Convert the "JoinDate" column to datetime format
# Any invalid values( "not available") will be turned into NaT(Not a Time) .

In [71]:
df["JoinDate"] = pd.to_datetime(df["JoinDate"],errors = "coerce")

#Check the data types of all columns after conversion
df.dtypes

Name                  object
Age                  float64
Salary               float64
JoinDate      datetime64[ns]
Department            object
dtype: object

# String Operations Method

In [72]:
# Remove spaces (strip) and make all all text lowercase in the "Department" column 
df["Department"] = df["Department"].str.strip().str.lower()

#Strandardize department names by replacing them with consistent labels
df["Department"] = df["Department"].replace({
    "finance": "Finance", #ensure proper case
    "hr":"HR", #keep HR uppercase
    "it":"IT"  #keep IT uppercase
})
# Display the cleaned DataFrame
df

      Name   Age   Salary   JoinDate Department
0    Alice  25.0  50000.0 2021-01-01         HR
1      Bob   NaN  60000.0 2021-02-14    Finance
2  Charlie  90.0      NaN        NaT         IT
3    Alice  25.0  50000.0 2021-01-01         HR
4      Eve  25.0  58000.0 2021-03-20    Finance
5     None  22.0  62000.0 2021-04-15    Finance

# Exercise

In [ ]:
#Check duplicate detection and handling